import 'dart:io';
/*Составить программу, которая спрашивает возраст человека и, если ему 18 лет и
больше, сообщает “Замечательно. Вы уже можете водить автомобиль”, а в
противном случае – “К сожалению, водить автомобиль Вам рановато”.*/

import 'dart:io';
void main() {
 print("Введите Ваш возраст:");
    var age = stdin.readLineSync();
    var ageint= int.parse(age ?? " ");
    if (ageint >= 18) {
      print('Замечательно. Вы уже можете водить автомобиль!');
    }
    else {
      print('К сожалению, водить автомобиль Вам рановато:()');
    }
}